#  ———————————————————————————————————————————————————————————————————————————
#  Tell Homebrew what to do when we run `brew bundle`
#  ———————————————————————————————————————————————————————————————————————————

# CLI tools
brew "gh"
brew "imagemagick"
brew "ffmpeg"
brew "node"
brew "wget"
brew "svgo"
brew "youtube-dl"

# Necessities 
cask "1password"
cask "arc"
cask "google-chrome"
cask "firefox"
cask "fantastical"
cask "bartender"
cask "reatangle-pro"
cask "telegram"
cask "warp"

# Work
cask "slack"
cask "zoom"

# Design/dev
cask "figma"
cask "visual-studio-code"
cask "imageoptim"
cask "contraste"
cask "sim-daltonism"

# Audio/video
cask "audio-hjiack"
cask "loopback"
cask "handbrake"
cask "cleanshot"
cask "obs"
cask "vlc"

# Entertainment
cask "discord"
cask "kindle"
cask "spotify"
