#  ———————————————————————————————————————————————————————————————————————————
#  Tell Homebrew what to do when we run `brew bundle`
#  ———————————————————————————————————————————————————————————————————————————

tap "homebrew/cask"
tap "homebrew/cask-drivers"

# CLI tools
brew "gh"
brew "imagemagick"
brew "ffmpeg"
brew "node"
brew "rbenv"
brew "svgo"
brew "thefuck"
brew "wget"
brew "youtube-dl"

# Required apps
cask "1password"
cask "firefox"
cask "google-chrome"
cask "keka"
cask "typora"
cask "mtmr"
  
# Work apps
cask "encryptme"
cask "slack"
cask "zoomus"

# Design/dev apps
cask "contraste"
cask "dash"
cask "docker"
cask "figma"
cask "sim-daltonism"
cask "transmission"
cask "visual-studio-code"

# Audio/video apps
cask "audio-hjiack"
cask "handbrake"
cask "kap"
cask "loom"
cask "obs"
cask "vlc"
cask "youtube-dl"

# Entertainment apps
cask "discord"
cask "kindle"
cask "spotify"
cask "steam"