#  ———————————————————————————————————————————————————————————————————————————
#  Tell Homebrew what to do when we run `brew bundle`
#  ———————————————————————————————————————————————————————————————————————————

# CLI tools
brew "gh"
brew "imagemagick"
brew "ffmpeg"
brew "node"
brew "rbenv"
brew "svgo"
brew "wget"
brew "tmux"
brew "youtube-dl"

# Required apps
cask "1password"
cask "firefox"
cask "google-chrome"
cask "fantastical"
cask "keka"
cask "bartender"
cask "hookshot"
cask "typora"
  
# Work apps
cask "slack"
cask "zoom"

# Design/dev apps
cask "figma"
cask "visual-studio-code"
cask "iterm2"
cask "imageoptim"
cask "contraste"
cask "sim-daltonism"

# Audio/video apps
cask "audio-hjiack"
cask "loopback"
cask "handbrake"
cask "cleanshot"
cask "kap"
cask "loom"
cask "obs"
cask "vlc"

# Entertainment apps
cask "discord"
cask "kindle"
cask "spotify"
cask "steam"
